Repository: zyk1172/Auralis
Catalog: Packages/AuralisCore/Sources/AIKit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: …（共 \(data.count) 字节）
en: … (\(data.count) bytes total)
zh_hant: …（共 \(data.count) 字節）

source: …（共 %lld 字节）
en: … (%lld bytes total)
zh_hant: …（共 %lld 字節）

source: <\(data.count) 字节非文本内容>
en: <\(data.count) bytes of non-text content>
zh_hant: <\(data.count) 字節非文本內容>

source: <%lld 字节非文本内容>
en: <%lld bytes of non-text content>
zh_hant: <%lld 字節非文本內容>

source: 响应流失败
en: Stream Error
zh_hant: 響應流失敗

source: 尚未配置 API Key，请先在设置中填写。
en: No API key is configured. Enter one in Settings first.
zh_hant: 尚未設定 API Key，請先在設定中填寫。

source: 当前接口协议暂不支持：%@。Auralis 目前支持 Chat Completions 与 Responses API，请更换模型或协议。
en: Unsupported endpoint protocol: %@. Auralis currently supports Chat Completions and the Responses API. Choose another model or protocol.
zh_hant: 目前不支援此介面協議：%@。Auralis 目前支援 Chat Completions 與 Responses API，請更換模型或協議。

source: 接口使用不安全的 HTTP 明文传输，且目标不在本机/局域网内（API Key 会被明文发送）。请改用 HTTPS 地址。
en: This endpoint uses insecure HTTP and is not local or on a private LAN. The API key would be sent in plaintext. Use HTTPS.
zh_hant: 介面使用不安全的 HTTP 明文傳輸，且目標不在本機／區域網路內（API Key 會以明文傳送）。請改用 HTTPS 位址。

source: 接口地址无效，请检查 Base URL 与 API 路径。
en: The endpoint is invalid. Check the Base URL and API path.
zh_hant: 介面位址無效，請檢查 Base URL 與 API 路徑。

source: 服务返回 HTTP \(status)：API Key 无效或权限不足，请检查设置中的 Key。
en: The service returned HTTP \(status): the API key is invalid or lacks permission. Check the key in Settings.
zh_hant: 服務返回 HTTP \(status)：API Key 無效或權限不足，請檢查設定中的 Key。

source: 服务返回 HTTP \(status)：接口路径错误，请检查 Base URL 是否已包含 /v1 等路径前缀。
en: The service returned HTTP \(status): the endpoint path is incorrect. Check whether the Base URL already includes a path prefix such as /v1.
zh_hant: 服務返回 HTTP \(status)：介面路徑錯誤，請檢查 Base URL 是否已包含 /v1 等路徑前綴。

source: 服务返回 HTTP \(status)：服务端或中转网关暂不可用（可能过载或维护中）。已自动重试仍失败，请稍后重试；若持续出现，请检查该 Base URL 对应服务的状态。
en: The service returned HTTP \(status): the server or gateway is temporarily unavailable. Automatic retries still failed; try again later. If it continues, check the service status for this Base URL.
zh_hant: 服務返回 HTTP \(status)：伺服器或中轉閘道暫時無法使用（可能過載或維護中）。自動重試仍失敗，請稍後重試；若持續發生，請檢查此 Base URL 對應服務的狀態。

source: 服务返回 HTTP \(status)。
en: The service returned HTTP \(status).
zh_hant: 服務返回 HTTP \(status)。

source: 服务返回 HTTP %lld：API Key 无效或权限不足，请检查设置中的 Key。
en: The service returned HTTP %lld: the API key is invalid or lacks permission. Check the key in Settings.
zh_hant: 服務返回 HTTP %lld：API Key 無效或權限不足，請檢查設定中的 Key。

source: 服务返回 HTTP %lld：接口路径错误，请检查 Base URL 是否已包含 /v1 等路径前缀。
en: The service returned HTTP %lld: the endpoint path is incorrect. Check whether the Base URL already includes a path prefix such as /v1.
zh_hant: 服務返回 HTTP %lld：介面路徑錯誤，請檢查 Base URL 是否已包含 /v1 等路徑前綴。

source: 服务返回 HTTP %lld：服务端或中转网关暂不可用（可能过载或维护中）。已自动重试仍失败，请稍后重试；若持续出现，请检查该 Base URL 对应服务的状态。
en: The service returned HTTP %lld: the server or gateway is temporarily unavailable. Automatic retries still failed; try again later. If it continues, check the service status for this Base URL.
zh_hant: 服務返回 HTTP %lld：伺服器或中轉閘道暫時無法使用（可能過載或維護中）。自動重試仍失敗，請稍後重試；若持續發生，請檢查此 Base URL 對應服務的狀態。

source: 服务返回 HTTP %lld。
en: The service returned HTTP %lld.
zh_hant: 服務返回 HTTP %lld。

source: 服务返回 HTTP 429：请求过于频繁被限流，已自动重试仍失败，请稍后重试。
en: The service returned HTTP 429: too many requests. Automatic retries still failed; try again later.
zh_hant: 服務返回 HTTP 429：要求過於頻繁而受到限流，自動重試仍失敗，請稍後重試。

source: 服务返回了空响应体
en: The service returned an empty response body.
zh_hant: 服務返回空的回應內容

source: 服务返回错误：\(detail)
en: The service returned an error: \(detail)
zh_hant: 服務返回錯誤：\(detail)

source: 服务返回错误：\(message)
en: The service returned an error: \(message)
zh_hant: 服務返回錯誤：\(message)

source: 服务返回错误：%@
en: The service returned an error: %@
zh_hant: 服務返回錯誤：%@

source: 未知错误
en: Unknown Error
zh_hant: 未知錯誤

source: 模型输出达到长度上限，结构化工具参数可能未完成。请缩小当前批次后重试。
en: The model reached its output limit, so structured tool arguments may be incomplete. Reduce the batch and try again.
zh_hant: 模型輸出達到長度上限，結構化工具參數可能未完成。請縮小目前批次後重試。

source: 用一句话确认连接正常。
en: Confirm that the connection works in one sentence.
zh_hant: 請用一句話確認連線正常。

source: 网络请求失败：\(message)
en: Network request failed: \(message)
zh_hant: 網路要求失敗：\(message)

source: 网络请求失败：%@
en: Network request failed: %@
zh_hant: 網路要求失敗：%@

source: 请求失败
en: Request Failed
zh_hant: 請求失敗

source: 返回内容无法解析，该服务可能不兼容 OpenAI Chat Completions 格式：\(detail)
en: The response could not be parsed. This service may not support the OpenAI Chat Completions format: \(detail)
zh_hant: 無法解析返回內容，此服務可能不相容 OpenAI Chat Completions 格式：\(detail)

source: 返回内容无法解析，该服务可能不兼容 OpenAI Chat Completions 格式：%@
en: The response could not be parsed. This service may not support the OpenAI Chat Completions format: %@
zh_hant: 無法解析返回內容，此服務可能不相容 OpenAI Chat Completions 格式：%@

source: 返回内容无法解析（已自动重试仍失败）：\(detail)
en: The response could not be parsed after automatic retries: \(detail)
zh_hant: 無法解析返回內容（自動重試仍失敗）：\(detail)

source: 返回内容无法解析（已自动重试仍失败）：%@
en: The response could not be parsed after automatic retries: %@
zh_hant: 無法解析返回內容（自動重試仍失敗）：%@
